app/views/sentences/_search_form.html.erb

    <%= f.label :sentence_tags_id_in, "タグ", class: "block text-sm mb-1" %>
    <% tags = SentenceTag.where(user: current_user).order(:name) %>
---
SELECT "sentence_tags".* FROM "sentence_tags" WHERE "sentence_tags"."user_id" = $1 ORDER BY "sentence_tags"."name" ASC  [["user_id", 2]]