app/views/sentences/_tag_selector.html.erb

SELECT "sentence_tags".* FROM "sentence_tags" WHERE "sentence_tags"."user_id" = $1 ORDER BY "sentence_tags"."name" ASC  [["user_id", 2]]
---
<%# 使ってない %>
<% tags = SentenceTag.where(user: current_user).order(:name) %>