app/views/sentences/new.html.erb

      <div class="pt-3">
        <% tags = SentenceTag.where(user: current_user).order(:name) %>
---
SELECT "sentence_tags".* FROM "sentence_tags" WHERE "sentence_tags"."user_id" = $1 ORDER BY "sentence_tags"."name" ASC  [["user_id", 2]]