app/views/vocabularies/index.html.erb

SELECT COUNT(*) FROM "vocabularies"
---
        <%# タグを表示 (本文の下・内部スクロールで崩れ防止) %>
          <% if v.vocabulary_tags.any? %>