app/controllers/sentences_controller.rb

INSERT INTO "sentences" ("body", "user_id", "sentence_category", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["body", "粉雪舞い散る桜の上で、今日も僕はひとり君を待っていた。"], ["user_id", 1], ["sentence_category", 0], ["created_at", "2025-09-09 10:24:36.160245"], ["updated_at", "2025-09-09 10:24:36.160245"]]
INSERT INTO "sentences" ("body", "user_id", "sentence_category", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["body", "さｄ"], ["user_id", 2], ["sentence_category", 0], ["created_at", "2025-09-09 11:38:45.617742"], ["updated_at", "2025-09-09 11:38:45.617742"]]
---
  def create
    @sentence = current_user.sentences.build(sentence_params)
    if @sentence.save
      redirect_to sentences_path, notice: t("flash.sentences.create.success")

SELECT "sentence_tags".* FROM "sentence_tags" WHERE "sentence_tags"."id" IN ($1, $2)  [["id", 2], ["id", 1]]
SELECT "sentence_tags".* FROM "sentence_tags" WHERE "sentence_tags"."user_id" = $1 ORDER BY "sentence_tags"."name" ASC  [["user_id", 2]]
---
  scope = search_scope
  @sentences = scope.order(ordering_params)
                    .includes(:sentence_tags)
                    .page(params[:page]).per(10)
  @sentence_tags = SentenceTag.where(user: current_user).order(:name)

UPDATE "sentences" SET "body" = $1, "updated_at" = $2 WHERE "sentences"."id" = $3
---
  def update
    if @sentence.update(sentence_params)

DELETE FROM "sentences" WHERE "sentences"."id" = $1  [["id", 5]]
---
def destroy
  @sentence.destroy!

SELECT "sentences".* FROM "sentences" WHERE "sentences"."user_id" = $1 AND "sentences"."id" = $2 LIMIT $3  [["user_id", 2], ["id", 4], ["LIMIT", 1]]
---
  def set_sentence
    @sentence = current_user.sentences.find(params[:id])