app/controllers/sentence_tags_controller.rb

SELECT "sentence_tags".* FROM "sentence_tags" WHERE "sentence_tags"."user_id" = $1 ORDER BY "sentence_tags"."name" ASC  [["user_id", 2]]
---
  def index
    @sentence_tags = current_user.sentence_tags.order(:name)

INSERT INTO "sentence_tags" ("name", "user_id", "created_at", "updated_at", "color") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", "テスト"], ["user_id", 2], ["created_at", "2025-09-09 16:45:40.058350"], ["updated_at", "2025-09-09 16:45:40.058350"], ["color", "#611f1f"]]
---
  def create
    @sentence_tag = current_user.sentence_tags.new(sentence_tag_params)
    if @sentence_tag.save

SELECT "sentence_tags".* FROM "sentence_tags" WHERE "sentence_tags"."user_id" = $1 AND "sentence_tags"."id" = $2 LIMIT $3  [["user_id", 2], ["id", 2], ["LIMIT", 1]]
UPDATE "sentence_tags" SET "updated_at" = $1, "color" = $2 WHERE "sentence_tags"."id" = $3  [["updated_at", "2025-09-09 17:24:35.496724"], ["color", "#b71a1a"], ["id", 17]]
---
  def update
    tag = current_user.sentence_tags.find(params[:id])
    if tag.update(sentence_tag_params)

SELECT "sentence_tags".* FROM "sentence_tags" WHERE "sentence_tags"."user_id" = $1 AND "sentence_tags"."id" = $2 LIMIT $3  [["user_id", 2], ["id", 1], ["LIMIT", 1]]
DELETE FROM "sentence_tags" WHERE "sentence_tags"."id" = $1  [["id", 1]]
---
  def destroy
    tag = current_user.sentence_tags.find(params[:id])
    tag.destroy