app/controllers/users_controller.rb

INSERT INTO "users" ("email", "name", "crypted_password", "salt", "created_at", "updated_at", "quiz_uses_count", "review_uses_count") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"
---
  def create
    @user = User.new(user_params)
    if @user.save