app/controllers/vocabularies_controller.rb

  def create
    @vocabulary = current_user.vocabularies.build(vocabulary_params)
    if @vocabulary.save
---
INSERT INTO "vocabularies" ("word", "reading", "meaning", "example", "part_of_speech", "created_at", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"

  def update
    if @vocabulary.update(vocabulary_params)
---
UPDATE "vocabularies" SET "example" = $1, "updated_at" = $2 WHERE "vocabularies"."id" = $3  [["example", "宵闇の中、僕は踵を返した。あの日のように、彼女がいるのではないかと期待して。"], ["updated_at", "2025-09-08 13:00:19.293525"], ["id", 3]]

def destroy
  @vocabulary.destroy
---
DELETE FROM "vocabularies" WHERE "vocabularies"."id" = $1  [["id", 8]]

  def set_vocabulary
    @vocabulary = current_user.vocabularies.find(params[:id])
---
SELECT "vocabularies".* FROM "vocabularies" WHERE "vocabularies"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]