app/controllers/vocabularies_controller.rb

SELECT "vocabularies".* FROM "vocabularies" WHERE ("vocabularies"."created_at" >= '2025-09-07 00:00:00' AND "vocabularies"."created_at" <= '2025-09-09 00:00:00') ORDER BY "vocabularies"."created_at" DESC LIMIT $1 OFFSET $2  [["LIMIT", 10], ["OFFSET", 0]]
SELECT COUNT(*) FROM "vocabularies"
---
  def index
    @q = Vocabulary.ransack(params[:q])
    @vocabularies = @q.result.order(created_at: :desc).page(params[:page]).per(10)